import ContentBox from "@/components/ContentBox";
import ShowAllContentShadow from "@/components/ShowAllContentShadow";


function ProductIntroductionBox() {
  return (
    <ContentBox title="معرفی">
      <ShowAllContentShadow>
        <div className="lg:text-base text-sm leading-8 text-black/70">
          <p className="pb-2">
            کتاب عادت‌های اتمی Atomic Habits اثر جیمز کلیر در سال 2018 منتشر شد.
            این کتاب در سال 1397 با ترجمه‌ی هادی بهمنی از سوی نشر نوین در ایران
            به چاپ رسید.
          </p>
          <p className="pb-2">
            کتاب عادت‌های اتمی یک چارچوب اثبات شده برای بهبود وضعیت زندگی ارائه
            می‌دهد. جیمز کلیر، یکی از برجسته‌ترین متخصصان جهان درزمینه‌ی ایجاد
            عادت، در این کتاب استراتژی‌های عملی را معرفی می‌کند که به شما
            می‌آموزد دقیقاً چگونه عادت‌های خوب در رفتارتان ایجاد، عادت‌های بد را
            ترک کنید و رفتارهای کوچک اما تأثیرگذاری را که منجر به نتایج چشمگیر
            می‌شود را بیاموزید. عادت‌های بد بارها و بارها تکرار می‌شوند و تمام
            زندگی ما را تحت تأثیر قرار می‌دهند.
          </p>
          <p className="pb-2">
            جیمز کلیر در کتاب عادت‌های اتمی با استفاده از مطالعاتش درزمینه‌ی
            زیست‌شناسی، روانشناسی و علوم اعصاب راهنمای بسیار قابل فهمی برای حذف‌
            عادت‌های بد و جایگزین کردن آن‌ها با عادت‌های خوب ارائه می‌دهد. در
            کتاب عادت‌های اتمی، خوانندگان با داستان‌های واقعی از دارندگان مدال
            طلای المپیک، هنرمندان برنده‌ی جایزه، رهبران تجارت، پزشکان
            نجات‌دهنده‌ی زندگی و کمدین‌های ستاره‌ای که از علم عادت‌های کوچک برای
            تسلط بر کار و زندگی خود استفاده می‌کنند، روبه‌رو می‌شوند.
          </p>
        </div>
      </ShowAllContentShadow>
    </ContentBox>
  );
}

export default ProductIntroductionBox;
